; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-3degree-100mindistance-3trucks-5packages-1250seed

(define (problem transport-three-cities-sequential-5nodes-1000size-3degree-100mindistance-3trucks-5packages-1250seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 266,960 -> 769,814
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 53)
  ; 769,814 -> 266,960
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 53)
  ; 648,480 -> 769,814
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 36)
  ; 769,814 -> 648,480
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 36)
  ; 845,27 -> 648,480
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 50)
  ; 648,480 -> 845,27
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 50)
  ; 921,557 -> 769,814
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 30)
  ; 769,814 -> 921,557
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 30)
  ; 921,557 -> 648,480
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 29)
  ; 648,480 -> 921,557
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 29)
  ; 2638,19 -> 2140,95
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 51)
  ; 2140,95 -> 2638,19
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 51)
  ; 2853,472 -> 2638,19
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 51)
  ; 2638,19 -> 2853,472
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 51)
  ; 2604,421 -> 2638,19
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 41)
  ; 2638,19 -> 2604,421
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 41)
  ; 2604,421 -> 2853,472
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 26)
  ; 2853,472 -> 2604,421
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 26)
  ; 2671,266 -> 2638,19
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 25)
  ; 2638,19 -> 2671,266
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 25)
  ; 2671,266 -> 2853,472
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 28)
  ; 2853,472 -> 2671,266
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 28)
  ; 2671,266 -> 2604,421
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 17)
  ; 2604,421 -> 2671,266
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 17)
  ; 1334,2012 -> 1202,2325
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 34)
  ; 1202,2325 -> 1334,2012
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 34)
  ; 1732,2354 -> 1334,2012
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 53)
  ; 1334,2012 -> 1732,2354
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 53)
  ; 1732,2354 -> 1923,2485
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 24)
  ; 1923,2485 -> 1732,2354
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 24)
  ; 1700,2723 -> 1923,2485
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 33)
  ; 1923,2485 -> 1700,2723
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 33)
  ; 1700,2723 -> 1732,2354
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 37)
  ; 1732,2354 -> 1700,2723
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 37)
  ; 845,27 <-> 2140,95
  (road city-1-loc-4 city-2-loc-1)
  (= (road-length city-1-loc-4 city-2-loc-1) 130)
  (road city-2-loc-1 city-1-loc-4)
  (= (road-length city-2-loc-1 city-1-loc-4) 130)
  (road city-1-loc-3 city-3-loc-1)
  (= (road-length city-1-loc-3 city-3-loc-1) 155)
  (road city-3-loc-1 city-1-loc-3)
  (= (road-length city-3-loc-1 city-1-loc-3) 155)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 155)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 155)
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-3)
  (at package-3 city-1-loc-2)
  (at package-4 city-3-loc-5)
  (at package-5 city-2-loc-2)
  (at truck-1 city-1-loc-2)
  (capacity truck-1 capacity-2)
  (at truck-2 city-3-loc-3)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-1)
  (capacity truck-3 capacity-4)
 )
 (:goal (and
  (at package-1 city-1-loc-5)
  (at package-2 city-2-loc-4)
  (at package-3 city-3-loc-4)
  (at package-4 city-1-loc-5)
  (at package-5 city-1-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 5
2. (pick-up truck-3 city-1-loc-2 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-1-loc-2) (capacity truck-3 capacity-4)
   added: (in package-3 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 5
3. (drive truck-3 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 5
4. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 5
5. (drive truck-3 city-1-loc-3 city-3-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-3-loc-1)
   goals met: 0 of 5
6. (drive truck-3 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-3-loc-2)
   goals met: 0 of 5
7. (drive truck-3 city-3-loc-2 city-3-loc-4)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-4)
   goals met: 0 of 5
8. (drop truck-3 city-3-loc-4 package-3 capacity-3 capacity-4)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-3)
   added: (at package-3 city-3-loc-4) (capacity truck-3 capacity-4)
   goals met: 1 of 5
9. (drive truck-3 city-3-loc-4 city-3-loc-5)
   deleted: (at truck-3 city-3-loc-4)
   added: (at truck-3 city-3-loc-5)
   goals met: 1 of 5
10. (pick-up truck-3 city-3-loc-5 package-4 capacity-3 capacity-4)
   deleted: (at package-4 city-3-loc-5) (capacity truck-3 capacity-4)
   added: (in package-4 truck-3) (capacity truck-3 capacity-3)
   goals met: 1 of 5
11. (drive truck-3 city-3-loc-5 city-3-loc-4)
   deleted: (at truck-3 city-3-loc-5)
   added: (at truck-3 city-3-loc-4)
   goals met: 1 of 5
12. (drive truck-3 city-3-loc-4 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-4)
   added: (at truck-3 city-3-loc-2)
   goals met: 1 of 5
13. (drive truck-3 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-1)
   goals met: 1 of 5
14. (drive truck-3 city-3-loc-1 city-2-loc-1)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-2-loc-1)
   goals met: 1 of 5
15. (drive truck-3 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-2)
   goals met: 1 of 5
16. (pick-up truck-3 city-2-loc-2 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-2-loc-2) (capacity truck-3 capacity-3)
   added: (in package-5 truck-3) (capacity truck-3 capacity-2)
   goals met: 1 of 5
17. (drive truck-3 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-3)
   goals met: 1 of 5
18. (pick-up truck-3 city-2-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-2-loc-3) (capacity truck-3 capacity-2)
   added: (in package-2 truck-3) (capacity truck-3 capacity-1)
   goals met: 1 of 5
19. (drive truck-3 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-4)
   goals met: 1 of 5
20. (drop truck-3 city-2-loc-4 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-1)
   added: (at package-2 city-2-loc-4) (capacity truck-3 capacity-2)
   goals met: 2 of 5
21. (pick-up truck-3 city-2-loc-4 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-2-loc-4) (capacity truck-3 capacity-2)
   added: (in package-1 truck-3) (capacity truck-3 capacity-1)
   goals met: 2 of 5
22. (drive truck-3 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-4)
   added: (at truck-3 city-2-loc-2)
   goals met: 2 of 5
23. (drive truck-3 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-1)
   goals met: 2 of 5
24. (drive truck-3 city-2-loc-1 city-1-loc-4)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-1-loc-4)
   goals met: 2 of 5
25. (drive truck-3 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-4)
   added: (at truck-3 city-1-loc-3)
   goals met: 2 of 5
26. (drive truck-3 city-1-loc-3 city-1-loc-5)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-5)
   goals met: 2 of 5
27. (drop truck-3 city-1-loc-5 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-1)
   added: (at package-1 city-1-loc-5) (capacity truck-3 capacity-2)
   goals met: 3 of 5
28. (drop truck-3 city-1-loc-5 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-2)
   added: (at package-4 city-1-loc-5) (capacity truck-3 capacity-3)
   goals met: 4 of 5
29. (drop truck-3 city-1-loc-5 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-3) (capacity truck-3 capacity-3)
   added: (at package-5 city-1-loc-5) (capacity truck-3 capacity-4)
   goals met: 5 of 5
